{
  "@context": "https://schema.org/",
  "@id": "https://www.cloudskillsboost.google/paths/36",
  "@type": "Course",
  "name": "Cloud Developer Learning Path",
  "description": "A Cloud Developer designs, builds, analyzes, and maintains cloud-native applications. This learning path guides you through a curated collection of on-demand courses, labs, and skill badges that provide you with real-world, hands-on experience using Google Cloud technologies essential to the Cloud Developer role. Once you complete the path, check out the Google Cloud Developer certification to take the next steps on your professional journey.",
  "image": [
    "https://cdn.qwiklabs.com/xQCzk3YUEAgajgXtMG2HSOJyI9aaEX9Xff2Iiu5Sd2w%3D"
  ],
  "provider": {
    "@type": "Organization",
    "name": "Google Cloud",
    "url": "https://cloud.google.com/learn"
  },
  "publisher": {
    "@type": "Organization",
    "name": "Google Cloud Skills Boost",
    "url": "https://cloudskillsboost.google"
  },
  "datePublished": "2024-11-25",
  "inLanguage": "en",
  "availableLanguage": [
    "en",
    "es",
    "fr",
    "id",
    "it",
    "ja",
    "ko",
    "pl",
    "pt",
    "tr",
    "zh"
  ],
  "offers": [
    {
      "@type": "Offer",
      "category": "Partially Free"
    },
    {
      "@type": "Offer",
      "category": "Subscription"
    }
  ],
  "hasCourseInstance": [
    {
      "@type": "CourseInstance",
      "courseMode": "Online",
      "courseWorkload": "P2DT22H5M31S"
    }
  ],
  "hasPart": [
    {
      "@type": "Course",
      "name": "A Tour of Google Cloud Hands-on Labs",
      "description": "In this first hands-on lab you will access the Google Cloud console and use these basic Google Cloud features: Projects, Resources, IAM Users, Roles, Permissions, and APIs.",
      "url": "https://www.cloudskillsboost.google/course_templates/1281"
    },
    {
      "@type": "Course",
      "name": "Google Cloud Fundamentals: Core Infrastructure",
      "description": "<p>Google Cloud Fundamentals: Core Infrastructure introduces important concepts and terminology for working with Google Cloud. Through videos and hands-on labs, this course presents and compares many of Google Cloud's computing and storage services, along with important resource and policy management tools.</p>",
      "url": "https://www.cloudskillsboost.google/course_templates/60"
    },
    {
      "@type": "Course",
      "name": "Developing Applications with Google Cloud: Foundations",
      "description": "<p>In this course, you learn the fundamentals of application development on Google Cloud. You learn best practices for cloud applications, and how to select compute and data options to match your application use cases. You're introduced to generative AI and how it's used to help build applications. You learn about authentication and authorization, application deployment, continuous integration and delivery, and monitoring and performance tuning for your applications running in Google Cloud. U...",
      "url": "https://www.cloudskillsboost.google/course_templates/874"
    },
    {
      "@type": "Course",
      "name": "Service Orchestration and Choreography on Google Cloud",
      "description": "<p>This course introduces you to event-based applications and teaches you how to use service orchestration and choreography to coordinate microservices. Using lectures and hands-on labs, you learn how to use Workflows, Eventarc, Cloud Tasks, and Cloud Scheduler to build microservices applications on Google Cloud.</p>",
      "url": "https://www.cloudskillsboost.google/course_templates/465"
    },
    {
      "@type": "Course",
      "name": "Developing Applications with Cloud Run Functions on Google Cloud",
      "description": "<p>In this course, you learn about Cloud Run functions, Google's serverless, fully-managed functions as a service (FaaS) product that lets you implement single-purpose function code that reponds to HTTP requests and events from your cloud infrastructure.</p>",
      "url": "https://www.cloudskillsboost.google/course_templates/505"
    },
    {
      "@type": "Course",
      "name": "Streamline App Development with Gemini Code Assist",
      "description": "<p>Designed for developers of all levels, this course introduces you to the core features and functionalities of Gemini Code Assist, an AI-powered app development collaborator for Google Cloud. From intelligent code suggestions and auto-completion to real-time error detection and refactoring assistance, you'll discover how Gemini Code Assist can significantly enhance your productivity and code quality, and save valuable time to focus on more productive and enjoyable tasks.</p>",
      "url": "https://www.cloudskillsboost.google/course_templates/1166"
    },
    {
      "@type": "Course",
      "name": "Developing Containerized Applications on Google Cloud",
      "description": "<p>In this course, you learn about containers and how to build, and package container images. </p>\n\n<p>The content in this course includes best practices for creating and securing containers, and </p>\n\n<p>provides an introduction to Cloud Run and Google Kubernetes Engine for application developers.</p>",
      "url": "https://www.cloudskillsboost.google/course_templates/530"
    },
    {
      "@type": "Course",
      "name": "Developing Applications with Cloud Run on Google Cloud: Fundamentals",
      "description": "<p>This course introduces the Cloud Run serverless platform for running applications. </p>\n\n<p>In this course, you learn about the fundamentals of Cloud Run, its resource model and the container lifecycle. </p>\n\n<p>You learn about service identities, how to control access to services, and how to develop and test your </p>\n\n<p>application locally before deploying it to Cloud Run. The course also teaches you how to integrate </p>\n\n<p>with other services on Google Cloud so you can build full-fea...",
      "url": "https://www.cloudskillsboost.google/course_templates/559"
    },
    {
      "@type": "Course",
      "name": "Integrating Applications with Gemini 1.0 Pro on Google Cloud",
      "description": "<p>This short course on integrating applications with Gemini 1.0 Pro models on Google Cloud helps you discover the Gemini API and its generative AI models. The course teaches you how to access the Gemini 1.0 Pro and Gemini 1.0 Pro Vision models from code. It lets you test the capabilities of the models with text, image, and video prompts from an app.</p>\n<p></p>\n<p></p>",
      "url": "https://www.cloudskillsboost.google/course_templates/980"
    },
    {
      "@type": "Course",
      "name": "Develop Serverless Apps with Firebase",
      "description": "Complete the intermediate <b>Develop Serverless Apps with Firebase</b> skill badge to demonstrate skills in the following: architecting and building serverless web applications with Firebase, utilizing Firestore for database management, automating deployment processes using Cloud Build, and integrating Google Assistant functionality into your applications. <p> <br/> A skill badge is an exclusive digital badge issued by Google Cloud in recognition of your proficiency with Google Cloud products...",
      "url": "https://www.cloudskillsboost.google/course_templates/649"
    },
    {
      "@type": "Course",
      "name": "Deploy Kubernetes Applications on Google Cloud",
      "description": "Complete the intermediate <b>Deploy Kubernetes Applications on Google Cloud</b> skill badge to demonstrate skills in the following: configuring and building Docker container images, creating and managing Google Kubernetes Engine (GKE) clusters, utilizing kubectl for efficient cluster management, and deploying Kubernetes applications with robust continuous delivery (CD) practices.<p> <br/> A skill badge is an exclusive digital badge issued by Google Cloud in recognition of your proficiency wit...",
      "url": "https://www.cloudskillsboost.google/course_templates/663"
    },
    {
      "@type": "Course",
      "name": "Develop Serverless Applications on Cloud Run",
      "description": "Complete the intermediate <b>Develop Serverless Applications on Cloud Run</b> skill badge to demonstrate skills in the following: integrating Cloud Run with Cloud Storage for data management, architecting resilient asynchronous systems using Cloud Run and Pub/Sub, constructing REST API gateways powered by Cloud Run, and building and deploying services on Cloud Run. <p> <br/> A skill badge is an exclusive digital badge issued by Google Cloud in recognition of your proficiency with Google Cloud...",
      "url": "https://www.cloudskillsboost.google/course_templates/741"
    },
    {
      "@type": "Course",
      "name": "Develop and Secure APIs with Apigee X",
      "description": "Earn a <b>skill badge</b> by completing the <b>Develop and Secure APIs with Apigee X</b> quest, where you learn how to modernize your APIs, use service accounts and Google Authentication to securely access backend services from Apigee API proxies, productize APIs using API products and developer portals, secure APIs using features like API keys, OAuth, private variables and fault handling, integrate Apigee with Google Cloud services like Pub/Sub and Cloud Logging, and call Google Cloud APIs l...",
      "url": "https://www.cloudskillsboost.google/course_templates/714"
    }
  ]
}
